In [1]:
import pandas as pd
import numpy as np

In [2]:
sal = df = pd.read_csv('https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv')

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

**check the head of DataFrame**

In [3]:
df.head()

   Id       EmployeeName  ...         Agency Status
0   1     NATHANIEL FORD  ...  San Francisco    NaN
1   2       GARY JIMENEZ  ...  San Francisco    NaN
2   3     ALBERT PARDINI  ...  San Francisco    NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5    PATRICK GARDNER  ...  San Francisco    NaN

[5 rows x 13 columns]

   Id       EmployeeName  ...         Agency Status
0   1     NATHANIEL FORD  ...  San Francisco    NaN
1   2       GARY JIMENEZ  ...  San Francisco    NaN
2   3     ALBERT PARDINI  ...  San Francisco    NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5    PATRICK GARDNER  ...  San Francisco    NaN

[5 rows x 13 columns]

**use the info method to find out how many entries there are.**

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

**What is the average BasePay?**

In [13]:
df['BasePay'] = pd.to_numeric(df['BasePay'], errors='coerce')
# df.info()
df['BasePay'].mean()

66325.44884050643

66325.44884050643

**What is the highest amount of OvertimePay in the dataset?**(need to handle missing data)

In [17]:
df['OvertimePay'] = pd.to_numeric(df['OvertimePay'], errors='coerce')
df['OvertimePay'].max()

245131.88

245131.88

**What is the Job Title of JOSEPH DRISCOLL?**

In [19]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much does JOSEPH DRISCOLL make (including benefits)**

In [20]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

24    270324.91
Name: TotalPayBenefits, dtype: float64

**What is the name of highest paid person**

In [22]:
maxx = df['TotalPayBenefits'].max()

In [25]:
df[ df['TotalPayBenefits'] == maxx]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

**What is the name of lowest paid person (including benefits)?**

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                      0
OvertimePay                                  0
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

**What was the average (mean) BasePay of all employees per year?(2011, 2014)**

In [27]:
df.groupby('Year')['BasePay'].mean().reset_index()

   Year       BasePay
0  2011  63595.956517
1  2012  65436.406857
2  2013  69630.030216
3  2014  66564.421924

   Year       BasePay
0  2011  63595.956517
1  2012  65436.406857
2  2013  69630.030216
3  2014  66564.421924

**How many unique job titles are there**

In [32]:
len(df['JobTitle'].unique())

# another

df['JobTitle'].nunique()

2159

2159

**What are the top 5 most common jobs?**

In [35]:
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**JobTitles with only one occurence in 2013?**

In [44]:
(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

202

202

**How many people has word chief in there jobtitle?**

In [51]:
def has_chief(str):
  return 'chief' in str.lower().split()

(df['JobTitle'].apply(has_chief)).sum()

477

477

**Is There a correlation between length of the jobtitle string and salary?**

In [52]:
df.describe()

                  Id        BasePay  ...           Year  Notes
count  148654.000000  148045.000000  ...  148654.000000    0.0
mean    74327.500000   66325.448841  ...    2012.522643    NaN
std     42912.857795   42764.635495  ...       1.117538    NaN
min         1.000000    -166.010000  ...    2011.000000    NaN
25%     37164.250000   33588.200000  ...    2012.000000    NaN
50%     74327.500000   65007.450000  ...    2013.000000    NaN
75%    111490.750000   94691.050000  ...    2014.000000    NaN
max    148654.000000  319275.010000  ...    2014.000000    NaN

[8 rows x 7 columns]

In [55]:
df.corr()

                        Id   BasePay  ...      Year  Notes
Id                1.000000 -0.204878  ...  0.968171    NaN
BasePay          -0.204878  1.000000  ...  0.033751    NaN
OvertimePay      -0.081505  0.266740  ...  0.027887    NaN
TotalPay         -0.211478  0.954494  ...  0.032090    NaN
TotalPayBenefits -0.092190  0.946595  ...  0.151947    NaN
Year              0.968171  0.033751  ...  1.000000    NaN
Notes                  NaN       NaN  ...       NaN    NaN

[7 rows x 7 columns]

                  JobTitle_len  TotalPayBenefits
JobTitle_len          1.000000         -0.036878
TotalPayBenefits     -0.036878          1.000000

In [62]:
cor = pd.DataFrame([
                   [1,2,3,4,5,6],
                   [7,8,9,10, 11, 12],
                   [6,5,4,3,2,1]],
                    ['a', 'b', 'c'],
                    ['d', 'e', 'f', 'g', 'h', 'i']
)

In [63]:
cor

   d  e  f   g   h   i
a  1  2  3   4   5   6
b  7  8  9  10  11  12
c  6  5  4   3   2   1

In [64]:
cor.corr()

          d         e         f         g         h         i
d  1.000000  0.933257  0.741935  0.520401  0.339422  0.207105
e  0.933257  1.000000  0.933257  0.792406  0.654654  0.544705
f  0.741935  0.933257  1.000000  0.958634  0.882498  0.809593
g  0.520401  0.792406  0.958634  1.000000  0.979864  0.943185
h  0.339422  0.654654  0.882498  0.979864  1.000000  0.990536
i  0.207105  0.544705  0.809593  0.943185  0.990536  1.000000